app/Livewire/DepartmentManagement.php

    public function render()
    {
        $this->departments = Department::query()->when($this->search, function($query) {
            return $query->where('name', 'like', '%' . $this->search . '%');
        })
        ->get();
---
select * from "departments" where "name"::text like '%Aliquip minim Nam ha%'

    public function edit($id)
    {
        $department = Department::findOrFail($id);
---
select * from "departments" where ("id" is null) limit 1

    public function store()
    {
        $this->validate();

        Department::updateOrCreate(
            ['id' => $this->departmentId ?? null],
            [
                'name' => $this->name,
                'description' => $this->description
            ]
        );
---
insert into "departments" ("name", "description", "updated_at", "created_at") values ('Lacota Mcmillan', 'Voluptas obcaecati s', '2025-03-06 17:40:38', '2025-03-06 17:40:38') returning "id"