app/Livewire/EmployeeForm.php

select * from "departments" order by "name" asc
select * from "roles" where "name" not in ('admin')
---
    public function mount($employee = null)
    {
        $this->employee = $employee;
        // dump($this->employee);
        $user = auth()->user();
        if($user->hasRole('Manager')) {
            $this->departments = Department::where('id', $user->employee->department_id)->get();
            // dd($this->departments);
        }
        else {
            // Get all departments
            $this->departments = Department::orderBy('name')->get();
        }

        // Handle the roles assignments base the role
        if($user->hasRole('Admin')) {
            $this->roles = Role::whereNotIn('name', ['admin'])->get();