app/Livewire/EmployeeFormations.php

    public function assignFormation()
    {
        $this->validate();

        $this->employee->formations()->attach($this->selectedFormation, [
            'start_date' => $this->startDate,
            'end_date' => $this->endDate
        ]);
---
insert into "employee_formation" ("employee_id", "end_date", "formation_id", "start_date") values (1, '2025-03-08', '1', '2025-03-07')

    public function render()
    {
        return view('livewire.employee-formations', [
            'formations' => Formation::all(),
            'employeeFormations' => $this->employee->formations
        ]);
---
select * from "formations"