app/Livewire/FormationManagement.php

    public function render()
    {
        $this->formations = Formation::latest()->get();
---
select * from "formations"

    public function store()
    {
        $this->validate();
        Formation::updateOrCreate(
            ['id' => $this->formationId ?? null],
            [
                'title' => $this->title,
                'description' => $this->description,
                'duration' => $this->duration
            ]
        );
---
insert into "formations" ("title", "description", "duration", "updated_at", "created_at") values ('Java', '', '2 weeks', '2025-03-06 21:19:43', '2025-03-06 21:19:43') returning "id"

    public function delete($id)
    {
        Formation::find($id)->delete();
---
select * from "formations" where ("id" is null) limit 1