app/Livewire/JobManagement.php

    public function mount()
    {
        $this->resetInputFields();
        $this->departments = Department::all();
---
select * from "departments"

    public function store()
    {
        $this->validate();
        Job::updateOrCreate(
            ['id' => $this->jobId ?? null],
            [
                'title' => $this->title,
                'description' => $this->description,
                'department_id' => $this->department_id
            ]
        );
---
insert into "jobs_titles" ("title", "description", "department_id", "updated_at", "created_at") values ('Software Engineer', '', '1', '2025-03-06 21:24:12', '2025-03-06 21:24:12') returning "id"
select * from "jobs_titles" where ("id" is null) limit 1