app/Livewire/VacationApprovals.php

select * from "vacation_requests" where "vacation_requests"."id" = 1 limit 1
---
    public function approve($requestId)
    {
        // dd($requestId);
        $request = VacationRequest::findOrFail($requestId);

select * from "employees" where "employees"."id" in (1)
select * from "vacation_requests" where exists (select * from "employees" where "vacation_requests"."employee_id" = "employees"."id" and "manager_id" is null) and "status" = 'pending' order by "created_at" desc
select * from "vacation_requests" where "status" = 'pending'
select * from "vacation_requests" where exists (select * from "employees" where "vacation_requests"."employee_id" = "employees"."id" and "manager_id" = 25) and "status" in ('pending', 'manager_approved') order by "created_at" desc
---
    public function render()
    {
        if($this->userRole === 'manager') {
            // dump('manager');
            $pendingRequests = VacationRequest::where('status', 'pending')->latest()->get();
            $historyRequests = VacationRequest::whereIn('status', ['approved', 'manager_rejected', 'hr_rejected'])
            ->whereHas('employee', function($query) {
                $query->where('manager_id', auth()->user()->employee->id);
            })
            ->latest()
            ->get();
        }
        else {
            // dump('hr');
            $pendingRequests = VacationRequest::whereIn('status', ['pending', 'manager_approved'])->latest()->get();
            $historyRequests = VacationRequest::whereIn('status', ['approved', 'manager_rejected', 'hr_rejected'])
            ->latest()
            ->get();