app/Livewire/VacationManagement.php

select * from "employees" where "user_id" = 24 limit 1
---
    public function mount()
    {
        // Get the employee record for the current user
        // dd(auth()->user()->id);
        $this->employee = Employee::where('user_id', auth()->id())->first();

select * from "employees" where "employees"."id" = 47 limit 1
insert into "vacation_balances" ("employee_id", "current_balance", "updated_at", "created_at") values (1, -0.00082532076388889, '2025-03-06 21:51:20', '2025-03-06 21:51:20') returning "id"
select * from "vacation_balances" where ("employee_id" = 1) limit 1
---
    private function loadVacationBalance()
    {
        $this->vacationBalance = VacationBalance::firstOrCreate(
            ['employee_id' => $this->employee->id],
            $this->calculateInitialBalance()
        );

select * from "vacation_requests" where "employee_id" = 1 order by "created_at" desc
---
    public function render()
    {
        $pendingRequests = VacationRequest::where('employee_id', $this->employee->id)
            ->orderBy('created_at', 'desc')
            ->get();