app/Http/Controllers/EmployeeController.php

    public function store(EmployeeRequest $request)
    {
        // dd($request->input('profile_picture_path'));
        $data = $request->all();

        if($request->hasFile('profile_photo_path')) {
            $data['profile_photo_path'] = $request->file('profile_photo_path')->store('images', 'public');
        } else {
            $data['profile_photo_path'] = "";
        }

        $defaultPassword = '12345678';

        DB::beginTransaction();

        try {
            $user = User::create([
                'name' => $data['name'],
                'email' => $data['email'],
                'password' => Hash::make($defaultPassword),
                'profile_photo_path' => $data['profile_photo_path']
            ]);

            // dump($user);
            $employee = Employee::create([
                'user_id' => $user->id,
                'job_title_id' => $data['job_title_id'],
                'salary' => $data['salary'],
                'department_id' => $data['department']
            ]);
---
insert into "employees" ("user_id", "job_title_id", "salary", "department_id", "updated_at", "created_at") values (24, '2', '8000', '1', '2025-03-06 21:26:47', '2025-03-06 21:26:47') returning "id"