app/Http/Controllers/EmployeeController.php

    public function index()
    {
        $user = auth()->user();
        // dump($user);

        if($user->hasRole('Manager')) {
            $managerDepartment = $user->employee->department_id;
            $employees = Employee::where('department_id', $managerDepartment)->get();
        } else {
            $employees = Employee::all();
---
select * from "employees"

    public function store(EmployeeRequest $request)
    {
        // dd($request->input('profile_picture_path'));
        $data = $request->all();

        if ($request->hasFile('profile_photo_path')) {
            $data['profile_photo_path'] = $request->file('profile_photo_path')->store('images', 'public');
        } else {
            $data['profile_photo_path'] = "";
        }

        $defaultPassword = '12345678';

        DB::beginTransaction();

        try {
            $user = User::create([
                'name' => $data['name'],
                'email' => $data['email'],
                'password' => Hash::make($defaultPassword),
                'profile_photo_path' => $data['profile_photo_path']
            ]);
---
insert into "users" ("name", "email", "password", "profile_photo_path", "updated_at", "created_at") values ('ayman', 'aymanelh0001@gmail.com', '$2y$12$4Hl9j91ULq3EHyzTNmxfEeyQLC.7o39T.YAuhopF8IR7YFfCW4nFK', '', '2025-03-06 21:26:47', '2025-03-06 21:26:47') returning "id"

    public function show($employeeId)
    {
        $employee = Employee::with([
            'user',
            'contracts' => function ($query) {
                $query->with('type')
                    ->orderBy('startDate', 'asc');
            }
        ])->findOrFail($employeeId);
---
select * from "contracts" where "contracts"."employee_id" in (1) order by "startDate" asc
select * from "users" where "users"."id" in (24)

    public function profile($id)
    {
        // dd($id);
        $employee = Employee::with(['user', 'position', 'department', 'formations',
            'contracts' => function($query) {
                $query->with('type')->orderby('startDate');
                // dd($query->toSql());
            },
        ])->where('user_id', $id)->firstOrFail();
---
select "formations".*, "employee_formation"."employee_id" as "pivot_employee_id", "employee_formation"."formation_id" as "pivot_formation_id" from "formations" inner join "employee_formation" on "formations"."id" = "employee_formation"."formation_id" where "employee_formation"."employee_id" in (24)
select * from "contracts" where "contracts"."employee_id" in (24) order by "startDate" asc
select * from "departments" where "departments"."id" in (14)
select * from "users" where "users"."id" in (47)